#### FabricationDimensionDefinition Members

---

|  |
| --- |
| FabricationDimensionDefinition Class   Methods   Properties   See Also |

The  FabricationDimensionDefinition  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FabricationDimensionDefinition |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsModifiable | If the fabrication dimension is modifiable by user. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | Fabrication dimension name. |
| Public property | Type | Fabrication dimension type. |
| Public property | UnitType | Fabrication dimension unit type. |

# See Also

FabricationDimensionDefinition Class

Autodesk.Revit.DB Namespace